tutorials/multiphase/reactingTwoPhaseEulerFoam/RAS/wallBoiling/0/alpha.liquid
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1606+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "5";
    object      alpha.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar>
1875
(
1
1
1
1
1
1
1
1
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 1;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar>
25
(
1
1
1
1
1
1
1
1
...
)
;
    }
    wall1
    {
        type            calculated;
        value           uniform 1;
    }
    wall2
    {
        type            calculated;
        value           nonuniform List<scalar>
75
(
0.999938287
0.999937231
0.99993711
0.999936975
0.99993684
0.999936705
0.999936569
0.999936432
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
