tutorials/multiphase/reactingTwoPhaseEulerFoam/RAS/wallBoiling/0/nut.liquid
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1606+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "5";
    object      nut.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   nonuniform List<scalar>
1875
(
4.57970073e-05
0.000104055696
0.000140550032
0.00016110283
0.000166072324
0.000156791271
0.000134780617
0.000101355957
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar>
25
(
4.57971478e-05
0.000104059157
0.000140559658
0.00016112098
0.000166100887
0.000156831739
0.000134833917
0.000101421773
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar>
25
(
4.58087834e-05
0.000104136434
0.000140756285
0.000161475399
0.000166643311
0.000157589236
0.000135830133
0.000102673523
...
)
;
    }
    wall1
    {
        type            nutkWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           nonuniform List<scalar>
75
(
5.27711099e-06
5.27711536e-06
5.27712047e-06
5.277126e-06
5.27713206e-06
5.27713874e-06
5.2771461e-06
5.27715417e-06
...
)
;
    }
    wall2
    {
        type            nutkWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           nonuniform List<scalar>
75
(
5.27701149e-06
5.27702214e-06
5.27702606e-06
5.27703166e-06
5.27703767e-06
5.27704431e-06
5.27705164e-06
5.27705969e-06
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
